[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:19:41
       comments: menuItemReview.comments,
     },
   });
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New MenuItemReview Created - id: ${menuItemReview.id} reviewerEmail: ${menuItemReview.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:21:7
   });
   const onSuccess = (menuItemReview) => {
     toast(
-      `New MenuItemReview Created - id: ${menuItemReview.id} reviewerEmail: ${menuItemReview.reviewerEmail}`,
+      ``,
     );
   };
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New MenuItemReview Created - id: 1 reviewerEmail: tladha@ucsb.edu",
