[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:43:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `MenuItemReview Updated - id: ${menuItemReview.id} reviewerEmail: ${menuItemReview.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
