[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:25:23
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
   // Stryker restore Regex
 
-  const email_regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const email_regex = /^[^\s@]+@[^\s@]+\.[^\s@]$/;
 
   return (
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/RecommendationRequest/RecommendationRequestForm.jsx:25:23
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
   // Stryker restore Regex
 
-  const email_regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+  const email_regex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
 
   return (
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:61:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester Email must be a valid email address."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:82:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "Professor Email is required. "}
-              {errors.professorEmail?.type === "pattern" &&
-                "Professor Email must be a valid email address."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
