[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:11:7
   buttonLabel = "Create",
 }) {
   const defaultValues = initialContents
-    ? {
-        ...initialContents,
-        requestTime: initialContents.requestTime.replace("Z", ""),
-      }
+    ? {}
     : {};
   // Stryker disable all
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(erik_rodriguez@ucsb.edu)

Expected the element to have value:
  erik_rodriguez@ucsb.edu
Received:

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:13:58
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        requestTime: initialContents.requestTime.replace("Z", ""),
+        requestTime: initialContents.requestTime.replace("", ""),
       }
     : {};
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2026-04-29T12:00)

Expected the element to have value:
  2026-04-29T12:00
Received:

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:13:63
   const defaultValues = initialContents
     ? {
         ...initialContents,
-        requestTime: initialContents.requestTime.replace("Z", ""),
+        requestTime: initialContents.requestTime.replace("Z", "Stryker was here!"),
       }
     : {};
killedBy: HelpRequestForm tests renders correctly when passing in initialContents
statusReason: expect(element).toHaveValue(2026-04-29T12:00)

Expected the element to have value:
  2026-04-29T12:00
Received:

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:57:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "Requester Email is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
