[Killed] BooleanLiteral
main/components/HelpRequests/HelpRequestForm.jsx:15:17
         ...initialContents,
         requestTime: initialContents.requestTime.replace("Z", ""),
       }
-    : { solved: false };
+    : { solved: true };
   // Stryker disable all
   const {
killedBy: on submit, makes request to backend, and redirects to /helprequests
statusReason: expected { …(6) } to deeply equal { …(6) }
