[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:47:5
       header: "Name",
       accessorKey: "name",
     },
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
+    {},
     {
       header: "Dining Commons Code",
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header
