[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-      name: UCSBDiningCommonsMenuItem.name,
-      diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-      station: UCSBDiningCommonsMenuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:13:13
   const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
     method: "POST",
-    params: {
-      name: UCSBDiningCommonsMenuItem.name,
-      diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-      station: UCSBDiningCommonsMenuItem.station,
-    },
+    params: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected {} to deeply equal { name: 'Pesto Pasta', …(2) }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:20:52
     },
   });
 
-  const onSuccess = (UCSBDiningCommonsMenuItem) => {
-    toast(
-      `New Dining Commons Menu Item Created - id: ${UCSBDiningCommonsMenuItem.id} name: ${UCSBDiningCommonsMenuItem.name}`,
-    );
-  };
+  const onSuccess = (UCSBDiningCommonsMenuItem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:22:7
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
     toast(
-      `New Dining Commons Menu Item Created - id: ${UCSBDiningCommonsMenuItem.id} name: ${UCSBDiningCommonsMenuItem.name}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New Dining Commons Menu Item Created - id: 3 name: Pesto Pasta",
