[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.jsx:24:30
     [],
   );
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommonsmenuitem/create"
-          style={{ float: "right" }}
-        >
-          Create Dining Commons Menu Item
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   return (
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: Create Dining Commons Menu Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
