[Killed] BlockStatement
src/main/utils/ucsbdiningcommonsmenuitemUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem with id 1 was deleted",

[Killed] ObjectLiteral
src/main/utils/ucsbdiningcommonsmenuitemUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsbdiningcommonsmenuitem",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
+  return {};
 }
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests what happens when you click delete, admin
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "UCSBDiningCommonsMenuItem with id 1 was deleted",
