[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:42:5
       header: "itemId",
       accessorKey: "itemId",
     },
-    {
-      header: "reviewerEmail",
-      accessorKey: "reviewerEmail",
-    },
+    {},
     {
       header: "stars",
killedBy: MenuItemReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header
