[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:105:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars must be between 1 and 5."}
+              {errors.stars || "Stars must be between 1 and 5."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Item Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:105:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars must be between 1 and 5."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
