[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:46:26
             isInvalid={Boolean(errors.orgCode)}
             {...register("orgCode", {
               required: "Organization Code is required.",
-              maxLength: {
-                value: 30,
-                message: "Max length 30 characters",
-              },
+              maxLength: {},
             })}
           />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
