[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:19:35
     navigate(`/ucsborganization/edit/${cell.row.original.orgCode}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/UCSBOrganization",
-    method: "DELETE",
-    params: {
-      orgCode: cell.row.original.orgCode,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrayDeclaration
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:38:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "Organization Code",
-      accessorKey: "orgCode",
-    },
-    {
-      header: "Short Translation",
-      accessorKey: "orgTranslationShort",
-    },
-    {
-      header: "Full Translation",
-      accessorKey: "orgTranslation",
-    },
-    {
-      header: "Inactive",
-      accessorKey: "inactive",
-      cell: ({ getValue }) => String(getValue()),
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Organization Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:47:5
       header: "Short Translation",
       accessorKey: "orgTranslationShort",
     },
-    {
-      header: "Full Translation",
-      accessorKey: "orgTranslation",
-    },
+    {},
     {
       header: "Inactive",
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:48:15
       accessorKey: "orgTranslationShort",
     },
     {
-      header: "Full Translation",
+      header: "",
       accessorKey: "orgTranslation",
     },
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Full Translation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBOrganizationTable"

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.jsx:54:13
     {
       header: "Inactive",
       accessorKey: "inactive",
-      cell: ({ getValue }) => String(getValue()),
+      cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  true
Received:
